@extends('arabic')

@section('head')
<style>@include('tahsin.style')</style>
@endsection

@section('content')
<div class="page">
  <table border="1">
    <tr>
      <td>اَنِئًا</td>
      <td>مَئِيْئًا</td>
      <td>الْمُؤْنِ</td>
      <td>مِنَ</td>
      <td>اَ أْ نَ</td>
      <td>اَ نِ</td>
      <td>اُ وْ اَ نْ</td>
      <td>اَ اِ اُ بَأْ</td>
    </tr>
    <tr>
      <td>بَنِبًا</td>
      <td>مَبِيْبًا</td>
      <td>الْمُبْنِ</td>
      <td>مِنَ</td>
      <td>بَبْنَ</td>
      <td>بَنِ</td>
      <td>بُوْ بَنْ</td>
      <td>بَ بِ بُ بَبْ</td>
    </tr>
    <tr>
      <td>تَنِتًا</td>
      <td>مَتِيْتًا</td>
      <td>الْمُتْنِ</td>
      <td>مِنَ</td>
      <td>تَتْنَ</td>
      <td>تَنِ</td>
      <td>تُوْتَنْ</td>
      <td>تَ تِ تُ بَتْ</td>
    </tr>
    <tr>
      <td>ثَنِثًا</td>
      <td>مَثِيْثًا</td>
      <td>الْمُثْنِ</td>
      <td>مِنَ</td>
      <td>ثَثْنَ</td>
      <td>ثَنِ</td>
      <td>ثُوْثَنْ</td>
      <td>ثَ ثِ ثُ بثْ</td>
    </tr>
    <tr>
      <td>جَنِجًا</td>
      <td>مَجِيْجًا</td>
      <td>الْمُجْنِ</td>
      <td>مِنَ</td>
      <td>جَجْنَ</td>
      <td>جَنِ</td>
      <td>جُوْ جَنْ</td>
      <td>جَ جِ جُ بَجْ</td>
    </tr>
    <tr>
      <td>حَنِحًا</td>
      <td>مَحِيْحًا</td>
      <td>الْمُحْنِ</td>
      <td>مِنَ</td>
      <td>حَحْنَ</td>
      <td>حَنِ</td>
      <td>حُوْحَنْ</td>
      <td>حَ حِ حُ بَحْ</td>
    </tr>
    <tr>
      <td>خَنِخًا</td>
      <td>مَخِيْخًا</td>
      <td>الْمُخْنِ</td>
      <td>مِنَ</td>
      <td>خَخْنَ</td>
      <td>خَنِ</td>
      <td>خُوْخًا</td>
      <td>خَ خِ خُ بَخْ</td>
    </tr>
    <tr>
      <td>دَنِدًا</td>
      <td>مَدِيْدًا</td>
      <td>الْمُدْنِ</td>
      <td>مِنَ</td>
      <td>دَدْنَ</td>
      <td>دَنِ</td>
      <td>دُوْدَنْ</td>
      <td>دَ دِ دُ بَدْ</td>
    </tr>
    <tr>
      <td>ذَنِذًا</td>
      <td>مَذِيْذًا</td>
      <td>الْمُذْنِ</td>
      <td>مِنَ</td>
      <td>ذَذْنَ</td>
      <td>ذَنِ</td>
      <td>ذُوْذَنْ</td>
      <td>ذَ ذِ ذُ بَذْ</td>
    </tr>
    <tr>
      <td>رَّنِرًا</td>
      <td>مَرِيْرًا</td>
      <td>الْمُرْنِ</td>
      <td>مِنَ</td>
      <td>رَرْنَ</td>
      <td>رَّنِ</td>
      <td>رُوْرَنْ</td>
      <td>رَ رِ رُ بَرْ</td>
    </tr>
    <tr>
      <td>زَنِزًا</td>
      <td>مَزِيْزًا</td>
      <td>الْمُزْنِ</td>
      <td>مِنَ</td>
      <td>زَزْنَ</td>
      <td>زَنِ</td>
      <td>زُوْزَنْ</td>
      <td>زَ زِ زُ بَزْ</td>
    </tr>
    <tr>
      <td>سَنِسًا</td>
      <td>مَسِيْسًا</td>
      <td>الْمُسْنِ</td>
      <td>مِنَ</td>
      <td>سَسْنَ</td>
      <td>سَنِ</td>
      <td>سُوْسَنْ</td>
      <td>سَ سِ سُ بَسْ</td>
    </tr>
    <tr>
      <td>شَنِشًا</td>
      <td>مَشِيْشًا</td>
      <td>الْمُشْنِ</td>
      <td>مِنَ</td>
      <td>شَشْنَ</td>
      <td>شَنِ</td>
      <td>شُوْشَنْ</td>
      <td>شَ شِ شُ بَشْ</td>
    </tr>
    <tr>
      <td>صَنِصًا</td>
      <td>مَصِيْصًا</td>
      <td>الْمُصْنِ</td>
      <td>مِنَ</td>
      <td>صَصْنَ</td>
      <td>صَنِ</td>
      <td>صُوْصَنْ</td>
      <td>صَ صِ صُ بَصْ</td>
    </tr>
    <tr>
      <td>ضَنِضًا</td>
      <td>مَضِيْضًا</td>
      <td>الْمُضْنِ</td>
      <td>مِنَ</td>
      <td>ضَضْنَ</td>
      <td>ضَنِ</td>
      <td>ضُوْضَنْ</td>
      <td>ضَ ضِ ضُ بَضْ</td>
    </tr>
    <tr>
      <td>طَنِطًا</td>
      <td>مَطِيْطًا</td>
      <td>الْمُطْنِ</td>
      <td>مِنَ</td>
      <td>طَطْنَ</td>
      <td>طَنِ</td>
      <td>طُوْ طَنْ</td>
      <td>طَ طِ طُ بَطْ</td>
    </tr>
    <tr>
      <td>ظَنِظًا</td>
      <td>مَظِيْظًا</td>
      <td>الْمُظْنِ</td>
      <td>مِنَ</td>
      <td>ظَظْنَ</td>
      <td>ظَنِ</td>
      <td>ظُوْظَنْ</td>
      <td>ظَ ظِ ظُ بَظْ</td>
    </tr>
    <tr>
      <td>عَنِعًا</td>
      <td>مَعِيْعًا</td>
      <td>الْمُعْنِ</td>
      <td>مِنَ</td>
      <td>عَعْنَ</td>
      <td>عَنِ</td>
      <td>عُوْعَنْ</td>
      <td>عَ عِ عُ بَعْ</td>
    </tr>
    <tr>
      <td>غَنِغًا</td>
      <td>مَغِيْغًا</td>
      <td>الْمُغْنِ</td>
      <td>مِنَ</td>
      <td>غَغْنَ</td>
      <td>غَنِ</td>
      <td>غُوْغَنْ</td>
      <td>غَ غِ غُ بَغْ</td>
    </tr>
    <tr>
      <td>فَنِفًا</td>
      <td>مَفِيْفًا</td>
      <td>الْمُفْنِ</td>
      <td>مِنَ</td>
      <td>فَفْنَ</td>
      <td>فَنِ</td>
      <td>فُوْفَنْ</td>
      <td>فَ فِ فُ بَفْ</td>
    </tr>
    <tr>
      <td>قَنِقًا</td>
      <td>مَقِيْقًا</td>
      <td>الْمُقْنِ</td>
      <td>مِنَ</td>
      <td>قَقْنَ</td>
      <td>قَنِ</td>
      <td>قُوْقَنْ</td>
      <td>قَ قِ قُ بَقْ</td>
    </tr>
    <tr>
      <td>كَنِكًا</td>
      <td>مَكِيْكًا</td>
      <td>الْمُكْنِ</td>
      <td>مِنَ</td>
      <td>كَكْنِ</td>
      <td>كَنِ</td>
      <td>كُوْكَنْ</td>
      <td>كَ كِ كُ بَكْ</td>
    </tr>
    <tr>
      <td>لَنِلًا</td>
      <td>مَلِيْلًا</td>
      <td>الْمُلْنِ</td>
      <td>مِنَ</td>
      <td>لَلْنِ</td>
      <td>لَنِ</td>
      <td>لُوْلَنْ</td>
      <td>لَ لِ لُ بَلْ</td>
    </tr>
    <tr>
      <td>مَنِمًا</td>
      <td>مَنِيْمًا</td>
      <td>الْمُمْنِ</td>
      <td>مِنَ</td>
      <td>مَمْنَ</td>
      <td>مَنِ</td>
      <td>مُوْمَنْ</td>
      <td>مَ مِ مُ بَمْ</td>
    </tr>
    <tr>
      <td>نَنِنًا</td>
      <td>مَنِيْنًا</td>
      <td>الْمُنْنِ</td>
      <td>مِنَ</td>
      <td>نَنْنَ</td>
      <td>نَنِ</td>
      <td>نُوْنَنْ</td>
      <td>نَ نِ نُ بَنْ</td>
    </tr>
    <tr>
      <td>وَنِوًا</td>
      <td>مَوِيْوًا</td>
      <td>الْمُوْنِ</td>
      <td>مِنَ</td>
      <td>وَوْنَ</td>
      <td>وَنِ</td>
      <td>وُوْوَنْ</td>
      <td>وَ وِ وُ بَوْ</td>
    </tr>
    <tr>
      <td>هَنِهًا</td>
      <td>مَهِيْهًا</td>
      <td>الْمُهْنِ</td>
      <td>مِنَ</td>
      <td>هَهْنَ</td>
      <td>هَنِ</td>
      <td>هُوْهَنْ</td>
      <td>هَ هِ هُ بَهْ</td>
    </tr>
    <tr>
      <td>يَنِيًا</td>
      <td>مَيِيْيًا</td>
      <td>الْمُيْنِ</td>
      <td>مِنَ</td>
      <td>يَيْنِ</td>
      <td>يَنِ</td>
      <td>يُوْيَنْ</td>
      <td>يَ يِ يُ بَيْ</td>
    </tr>
  </table>
  <div dir="rtl">
    <span class="arabic" dir="rtl" lang="ar">
    </span>
  </div>
</div>
@endsection

@section('body')
<script>@include('tahsin.script')</script>
@endsection
